{
  "architectures": [
      "Ovis2_5"
  ],
  "auto_map": {
    "AutoConfig": "configuration_ovis2_5.Ovis2_5_Config",
    "AutoModelForCausalLM": "modeling_ovis2_5.Ovis2_5"
  },
  "conversation_formatter_class": "Qwen3ConversationFormatter",
  "hidden_size": 4096,
  "vocab_size": 151936,
  "num_attention_heads": 32,
  "max_position_embeddings": 40960,
  "llm_config": {
      "_attn_implementation_autoset": true,
      "_name_or_path": "Qwen/Qwen3-8B",
      "architectures": [
          "Qwen3ForCausalLM"
      ],
      "attention_bias": false,
      "attention_dropout": 0.0,
      "bos_token_id": 151643,
      "eos_token_id": 151645,
      "head_dim": 128,
      "hidden_act": "silu",
      "hidden_size": 4096,
      "initializer_range": 0.02,
      "intermediate_size": 12288,
      "max_position_embeddings": 40960,
      "max_window_layers": 36,
      "model_type": "qwen3",
      "num_attention_heads": 32,
      "num_hidden_layers": 36,
      "num_key_value_heads": 8,
      "rms_norm_eps": 1e-06,
      "rope_scaling": null,
      "rope_theta": 1000000,
      "sliding_window": null,
      "torch_dtype": "float32",
      "use_cache": true,
      "use_sliding_window": false,
      "vocab_size": 151936
  },
  "model_type": "ovis2_5",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_cache": true,
  "visual_vocab_size": 65536,
  "vit_config": {
      "_attn_implementation_autoset": true,
      "_name_or_path": "google/siglip2-so400m-patch16-512", 
      "attention_dropout": 0.0,
      "fullatt_block_indexes": null,
      "hidden_act": "gelu_pytorch_tanh",
      "hidden_size": 1152,
      "hidden_stride": 2,
      "image_size": 512,
      "intermediate_size": 4304,
      "layer_norm_eps": 1e-06,
      "model_type": "siglip2_navit",
      "num_attention_heads": 16,
      "num_channels": 3,
      "num_hidden_layers": 27,
      "num_patches": -1,
      "patch_size": 16,
      "preserve_original_pe": true,
      "temporal_patch_size": 1,
      "torch_dtype": "float32",
      "use_rope": true,
      "window_size": 112
  }
}
